/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: dlg_run_mod_sel.cpp

* 功能描述: 运行模式选择文件

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.4.15

* 修	改:
**************************************************************************************/

#include "dlg_run_mod_sel.h"
#include "ui_dlg_run_mod_sel.h"
#include "tcmd.h"
/*************************************************************************
* 函数名称: Dlg_Run_Mod_Sel
* 功    能: 构造函数
* 输入参数: QWidget *parent
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
Dlg_Run_Mod_Sel::Dlg_Run_Mod_Sel(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::Dlg_Run_Mod_Sel)
{
    ui->setupUi(this);
}
/*************************************************************************
* 函数名称: ~Dlg_Run_Mod_Sel
* 功    能: 析构函数
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
Dlg_Run_Mod_Sel::~Dlg_Run_Mod_Sel()
{
    delete ui;
}
/*************************************************************************
* 函数名称: on_btnMana_clicked
* 功    能: 运行手动模式
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::on_btnMana_clicked()
{
    r_model = Frm_Run::R_MANA;
    QDialog::accept();
}
/*************************************************************************
* 函数名称: on_btnAuto_clicked
* 功    能: 点击全自动运行模式
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::on_btnAuto_clicked()
{
    r_model = Frm_Run::R_AUTO;
    SndPgm();
    QDialog::accept();
}
/*************************************************************************
* 函数名称: on_btnCan_clicked
* 功    能: 点击退出按钮
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::on_btnCan_clicked()
{
    QDialog::reject();
}
/*************************************************************************
* 函数名称: on_btnSPrd_clicked
* 功    能: 点击单周期运行按钮
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::on_btnSPrd_clicked()
{
    r_model = Frm_Run::R_SPRD;
    SndPgm();
    QDialog::accept();
}
/*************************************************************************
* 函数名称: on_btnSStp_clicked
* 功    能: 点击单步运行按钮
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::on_btnSStp_clicked()
{
    r_model = Frm_Run::R_SSTP;
    SndPgm();
    QDialog::accept();
}
/*************************************************************************
* 函数名称: SndPgm
* 功    能: 下载示教程序
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void Dlg_Run_Mod_Sel::SndPgm()
{
    QMutexLocker locker(&mutex_com);
    if(com20.bNewForSnd)
    {
        pComBuf2.push_back((TCom*)&com20);
        //com20.bNewForSnd = false;
    }

    switch(r_model)
    {
    case Frm_Run::R_AUTO:
        comE0.para.runtype  = TComE0::AUTO;
        pComBuf2.push_back((TCom*)&comE0);
        break;
    case Frm_Run::R_SPRD:
        comE0.para.runtype  = TComE0::SGL_CYCLE;
        pComBuf2.push_back((TCom*)&comE0);
        break;
    default:
        break;
    }
}

//==========================================================================================
// End of file.
//==========================================================================================
