/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: frm_lang.h

* 功能描述: 语言选择头文件

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.4.15

* 修	改:
**************************************************************************************/

#ifndef FRM_LANG_H
#define FRM_LANG_H

#include "twidget.h"

namespace Ui {
class Frm_Lang;
}

class Frm_Lang : public TWidget
{
    Q_OBJECT

public:
    Frm_Lang();
    ~Frm_Lang();

private:
    Ui::Frm_Lang *ui;
};

#endif // FRM_LANG_H

//==========================================================================================
// End of file.
//==========================================================================================
