/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: frm_hlp.h

* 功能描述: 帮助界面

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.7.6

* 修	改:
**************************************************************************************/

#ifndef FRM_HLP_H
#define FRM_HLP_H

#include "twidget.h"

namespace Ui {
    class Frm_Hlp;
}

class Frm_Hlp : public TWidget
{
    Q_OBJECT

public:
    Frm_Hlp();
    ~Frm_Hlp();

private:
    Ui::Frm_Hlp *ui;
};

#endif // FRM_HLP_H

//==========================================================================================
// End of file.
//==========================================================================================
