/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: tdrvqdec.cpp

* 功能描述: 扫描旋转编码器

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.7.6

* 修	改:
**************************************************************************************/

#include "tdrvqdec.h"
#include "qa5driver.h"

/*************************************************************************
* 函数名称: TDrvQdec
* 功   能: 构造函数
* 输入参数: parent 根类句柄
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
TDrvQdec::TDrvQdec(QObject *parent) :
    QThread(parent)
{
    m_bPD5=m_bPD6=true;
}
/*************************************************************************
* 函数名称: run
* 功   能: 扫描函数
* 输入参数:
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TDrvQdec::run()
{
    while(1)
    {
        //emit sigQdec(DOWN);
        int key_no;bool key_lev;
        bool bret=a5drv.read_qdec(&key_no,&key_lev);
        if(bret)
        {
            if(key_no==0x10d)
            {
                m_bPD5=key_lev;
                if(!key_lev&&!m_bPD6)
                {
                    m_bPD5=m_bPD6=true;
                    emit sigQdec(DOWN);
                }
            }
            else if(key_no==0x10e)
            {
                m_bPD6=key_lev;
                if(!key_lev&&!m_bPD5)
                {
                    m_bPD5=m_bPD6=true;
                    emit sigQdec(UP);
                }
            }
        }
    }
}


TDrvQdec drv_qdec;

//==========================================================================================
// End of file.
//==========================================================================================
