/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: tdrvkey.cpp

* 功能描述: 按键扫描线程

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.7.6

* 修	改:
**************************************************************************************/

#include "tdrvkey.h"
#include "qa5driver.h"

/*************************************************************************
* 函数名称: TDrvKey
* 功   能: 根类句柄
* 输入参数:
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
TDrvKey::TDrvKey(QObject *parent) :
    QThread(parent)
{

}
/*************************************************************************
* 函数名称: run
* 功   能: 扫描函数
* 输入参数:
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TDrvKey::run()
{

    while(1)
    {
        int key_no;bool key_lev;
        bool bret = a5drv.read_key(&key_no,&key_lev);

        //printf("key000\n");
        if(bret){
            //printf("no:%x,lev:%x\n",key_no,key_lev);
            emitMsg((DRVTYP)(key_no),(DRVLEV)key_lev);
        }
    }
}
/*************************************************************************
* 函数名称: emitMSG
* 功   能: 发送按键消息
* 输入参数: dt 按键值 dl 按键状态
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TDrvKey::emitMsg(DRVTYP dt,DRVLEV dl)
{
    MSG msg;
    msg.msgT = dt;
    msg.msgL = dl;
    emit sigKey((int)msg.msg);
}


TDrvKey drv_key;      //底层驱动扫描线程

//==========================================================================================
// End of file.
//==========================================================================================
