/*************************************************************************************

* Copyright (c) 2014, 宁波韵升中央研究院

* All rights reserved.

* 文件名称: ttblviewf.cpp

* 功能描述: 自定义QTableView类

* 当前版本: 1.000

* 编	写: 汤超阳

* 创建日期: 2014.8.23

* 修	改:
**************************************************************************************/

#include "ttblviewf.h"

/*************************************************************************
* 函数名称: TTblViewF
* 功   能: 构造函数
* 输入参数: QWidget *parent 父类句柄
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
TTblViewF::TTblViewF(QWidget *parent) :
    QTableView(parent)
{
}
/*************************************************************************
* 函数名称: mousePressEvent
* 功   能: 鼠标按下事件
* 输入参数: QMouseEvent *event 鼠标事件
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TTblViewF::mousePressEvent(QMouseEvent *event)
{
    return;
}
/*************************************************************************
* 函数名称: mouseMoveEvent
* 功   能: 鼠标移动
* 输入参数: QMouseEvent *event 鼠标事件
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TTblViewF::mouseMoveEvent(QMouseEvent *event)
{
    return;
}
/*************************************************************************
* 函数名称: mouseReleaseEvent
* 功   能: 鼠标释放
* 输入参数: QMouseEvent *event 鼠标事件
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TTblViewF::mouseReleaseEvent(QMouseEvent *event)
{
    return;
}
/*************************************************************************
* 函数名称: mouseDoubleClickEvent
* 功   能: 鼠标双击
* 输入参数: QMouseEvent *event 鼠标事件
* 输出参数: 无
* 返 回 值: 无
*************************************************************************/
void TTblViewF::mouseDoubleClickEvent(QMouseEvent *event)
{
    return;
}


//==========================================================================================
// End of file.
//==========================================================================================
